; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v6 - type_2 ?v8 - type_3)
 	      (pred_4 ?v2 - object ?v8 - type_3)
	      (pred_1 ?v6 - type_2 ?v4 - type_1)
	      (pred_2 ?v6 - type_2 ?v2 - object ?v4 - type_1))

   (:action op_2
       :parameters  (?v6 - type_2 ?v5 ?v1 - type_3)
       :precondition (and  (pred_3 ?v6 ?v5))
       :effect (and  (pred_3 ?v6 ?v1)
		     (not (pred_3 ?v6 ?v5))))

   (:action op_3
       :parameters (?v6 - type_2 ?v7 - object ?v3 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_4 ?v7 ?v3) (pred_3 ?v6 ?v3) (pred_1 ?v6 ?v4))
       :effect (and (pred_2 ?v6 ?v7 ?v4)
		    (not (pred_4 ?v7 ?v3)) 
		    (not (pred_1 ?v6 ?v4))))

   (:action op_1
       :parameters (?v6 - type_2 ?v7 - object ?v3 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_2 ?v6 ?v7 ?v4) (pred_3 ?v6 ?v3))
       :effect (and (pred_4 ?v7 ?v3)
		    (pred_1 ?v6 ?v4)
		    (not (pred_2 ?v6 ?v7 ?v4)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_06 - type_2
obj_10 obj_03 - type_1
obj_09 obj_02 obj_01 obj_08 - type_3
obj_05 obj_07 obj_04 - object)
(:init
(pred_3 obj_06 obj_08)
(pred_1 obj_06 obj_10)
(pred_1 obj_06 obj_03)
(pred_4 obj_05 obj_01)
(pred_4 obj_07 obj_02)
(pred_4 obj_04 obj_01)
)
(:goal
(and
(pred_4 obj_05 obj_02)
(pred_4 obj_07 obj_09)
(pred_4 obj_04 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_06 ?b obj_10))))
)
)

; plan
1. (op_2 obj_06 obj_08 obj_02)
   deleted: (pred_3 obj_06 obj_08)
   added: (pred_3 obj_06 obj_02)
   goals met: 0 of 3
2. (op_3 obj_06 obj_07 obj_02 obj_03)
   deleted: (pred_4 obj_07 obj_02) (pred_1 obj_06 obj_03)
   added: (pred_2 obj_06 obj_07 obj_03)
   goals met: 0 of 3
3. (op_2 obj_06 obj_02 obj_09)
   deleted: (pred_3 obj_06 obj_02)
   added: (pred_3 obj_06 obj_09)
   goals met: 0 of 3
4. (op_1 obj_06 obj_07 obj_09 obj_03)
   deleted: (pred_2 obj_06 obj_07 obj_03)
   added: (pred_4 obj_07 obj_09) (pred_1 obj_06 obj_03)
   goals met: 1 of 3
5. (op_2 obj_06 obj_09 obj_01)
   deleted: (pred_3 obj_06 obj_09)
   added: (pred_3 obj_06 obj_01)
   goals met: 1 of 3
6. (op_3 obj_06 obj_04 obj_01 obj_03)
   deleted: (pred_4 obj_04 obj_01) (pred_1 obj_06 obj_03)
   added: (pred_2 obj_06 obj_04 obj_03)
   goals met: 1 of 3
7. (op_2 obj_06 obj_01 obj_09)
   deleted: (pred_3 obj_06 obj_01)
   added: (pred_3 obj_06 obj_09)
   goals met: 1 of 3
8. (op_1 obj_06 obj_04 obj_09 obj_03)
   deleted: (pred_2 obj_06 obj_04 obj_03)
   added: (pred_4 obj_04 obj_09) (pred_1 obj_06 obj_03)
   goals met: 2 of 3
9. (op_2 obj_06 obj_09 obj_01)
   deleted: (pred_3 obj_06 obj_09)
   added: (pred_3 obj_06 obj_01)
   goals met: 2 of 3
10. (op_3 obj_06 obj_05 obj_01 obj_03)
   deleted: (pred_4 obj_05 obj_01) (pred_1 obj_06 obj_03)
   added: (pred_2 obj_06 obj_05 obj_03)
   goals met: 2 of 3
11. (op_2 obj_06 obj_01 obj_02)
   deleted: (pred_3 obj_06 obj_01)
   added: (pred_3 obj_06 obj_02)
   goals met: 2 of 3
12. (op_1 obj_06 obj_05 obj_02 obj_03)
   deleted: (pred_2 obj_06 obj_05 obj_03)
   added: (pred_4 obj_05 obj_02) (pred_1 obj_06 obj_03)
   goals met: 3 of 3
